#ifndef _COMMON_GAME_LOGIC_DEV_DEBUG_H_
#define _COMMON_GAME_LOGIC_DEV_DEBUG_H_

//////////////////////////////////////////////////////////////////////////
// 提供用于统一管理测试宏标志的头文件
// 如果有测试代码需要在发行时统一禁用，可以用此头文件
// 注：本头文件要避免包含在其它头文件中，以避免更改标志时导致不必要的重新编译
// 
// 测试宏标志在发行版本中统一全部禁用
//////////////////////////////////////////////////////////////////////////

#if RELEASE_RUN_VER //发行版本

//-------------------------------------------------------------------------*/
#	define ACCEPT_BOT						0			// 开启机器人测试
#	define USE_GM_CLINET					0			// 开启调试客户端GM命令

#else // 非发行版本

//-------------------------------------------------------------------------*/
#	define ACCEPT_BOT						1			// 开启机器人测试
#	define USE_GM_CLINET					1			// 开启调试客户端GM命令

//-------------------------------------------------------------------------*/
// 公会功能测试宏标志
//#   define FUNC_TEST_GUILD

// 战斗异常状态日志
#   define ABNORMAL_STATE_LOG

#endif



#endif // !_COMMON_GAME_LOGIC_DEV_DEBUG_H_
